In [46]:
# run code, and import env
import env
import pandas as pd
import numpy as np

In [47]:
user=env.user
host=env.host
password=env.password
url=f'mysql+pymysql://{user}:{password}@{host}/employees'
def get_db_url(n):
    n=url
    return url

In [52]:
# extra information from employees table
pd.read_sql('SELECT * FROM employees',url)

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [49]:
# intentionally make error in url
url = f'get_db_url://{uer}:{password}@{host}/employees'
# nameError

NameError: name 'uer' is not defined

In [ ]:
# intentionally make error in SQL query
pd.read_sql('SELECT * FROM employees',url)
# nosuchmoduleerror

In [50]:
pd.read_sql('SELECT * FROM employees',url)
pd.read_sql('SELECT * FROM titles',url)

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [59]:
pd.read_sql('SELECT * FROM employees',url).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [60]:
pd.read_sql('SELECT * FROM titles',url).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [61]:
pd.read_sql('SELECT * FROM titles',url).sort_values('to_date')

        emp_no            title   from_date     to_date
16064    20869         Engineer  1985-02-17  1985-03-01
406358  474918         Engineer  1985-02-10  1985-03-11
346216  434232            Staff  1985-02-26  1985-03-20
35527    34059  Senior Engineer  1985-02-10  1985-03-23
277603  287732            Staff  1985-04-14  1985-04-17
...        ...              ...         ...         ...
191714  229523  Senior Engineer  1996-11-29  9999-01-01
191712  229522  Senior Engineer  2002-01-22  9999-01-01
191707  229520            Staff  1999-09-07  9999-01-01
191723  229529  Senior Engineer  1997-04-05  9999-01-01
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [67]:
pd.read_sql('SELECT * FROM titles WHERE to_date<now()',url).sort_values('to_date',ascending=False)

        emp_no             title   from_date     to_date
70899   204324  Technique Leader  1985-02-10  2002-08-01
54796    90666          Engineer  1997-08-01  2002-08-01
177487  461960             Staff  1997-08-01  2002-08-01
146450  416185             Staff  1999-10-28  2002-08-01
31077    55876             Staff  1995-08-01  2002-08-01
...        ...               ...         ...         ...
127199  287732             Staff  1985-04-14  1985-04-17
16209    34059   Senior Engineer  1985-02-10  1985-03-23
158686  434232             Staff  1985-02-26  1985-03-20
186225  474918          Engineer  1985-02-10  1985-03-11
7303     20869          Engineer  1985-02-17  1985-03-01

[203184 rows x 4 columns]

In [68]:
# exercises 2

In [75]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

pd.concat([users,roles],axis=0, join='left')

ValueError: Only can inner (intersect) or outer (union) join the other axis

In [76]:

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

pd.concat([users,roles],axis=0, join='outer')

   id       name  role_id
0   1        bob      1.0
1   2        joe      2.0
2   3      sally      3.0
3   4       adam      3.0
4   5       jane      NaN
5   6       mike      NaN
0   1      admin      NaN
1   2     author      NaN
2   3   reviewer      NaN
3   4  commenter      NaN

In [77]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike']
})
users
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)

KeyError: 'role_id'

In [84]:
# Load the dataset and store it in the variable mpg.

from pydataset import data
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [85]:
mpg.shape

(234, 11)

In [96]:
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [98]:
len(mpg.groupby('manufacturer'))

15

In [99]:
len(mpg.groupby('model'))

38

In [108]:
mpg['mileage_difference']=mpg.hwy-mpg.cty

In [109]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

In [110]:
mpg['average_mileage']=round(mpg.hwy-mpg.cty.mean(),2)

In [111]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,12.14
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,12.14
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,14.14
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,13.14
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,9.14
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,11.14
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,12.14
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,9.14
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,9.14
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,9.14

In [150]:
mpg['is_automatic']=np.where(mpg.trans.str.contains('auto'), 'Y', 'N')

In [151]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,12.14,Y
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,12.14,N
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,14.14,N
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,13.14,Y
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,9.14,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,11.14,Y
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,12.14,N
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,9.14,Y
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,9.14,N
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,9.14,Y

In [166]:
mpg['combined_mpg']=(mpg.cty+mpg.hwy)/2

In [180]:
mpg[['manufacturer','model','year','combined_mpg']].sort_values(by='combined_mpg',ascending=False)

    manufacturer                model  year  combined_mpg
222   volkswagen           new beetle  1999          39.5
213   volkswagen                jetta  1999          38.5
223   volkswagen           new beetle  1999          35.0
197       toyota              corolla  2008          32.5
196       toyota              corolla  1999          30.5
..           ...                  ...   ...           ...
127         jeep   grand cherokee 4wd  2008          10.5
60         dodge          durango 4wd  2008          10.5
66         dodge  ram 1500 pickup 4wd  2008          10.5
70         dodge  ram 1500 pickup 4wd  2008          10.5
55         dodge    dakota pickup 4wd  2008          10.5

[234 rows x 4 columns]

In [195]:
mpg.groupby('is_automatic').combined_mpg.max()

is_automatic
N    39.5
Y    35.0
Name: combined_mpg, dtype: float64

In [196]:
# exercises3

In [201]:
user=env.user
host=env.host
password=env.password
url=f'mysql+pymysql://{user}:{password}@{host}/chipotle'
def get_db_url(n):
    n=url
    return url
orders=pd.read_sql('SELECT * FROM orders',url)

In [202]:
orders

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75

In [225]:
orders['item_prices_i']=orders.item_price.split('$')
orders.item_prices_i

AttributeError: 'Series' object has no attribute 'split'

In [222]:
orders.groupby('order_id').agg(sum(int('item_prices_i')))

ValueError: invalid literal for int() with base 10: 'item_prices_i'

In [207]:
orders.groupby('item_name').count().sort_values(by="quantity",ascending=False).head(3)

                      id  order_id  quantity  choice_description  item_price
item_name
Chicken Bowl         726       726       726                 726         726
Chicken Burrito      553       553       553                 553         553
Chips and Guacamole  479       479       479                 479         479